class Project {
  final String? title, description;

  Project({this.title, this.description});
}

List<Project> demo_projects = [
  Project(
    title: "Жооптуу администратор панели же башкаруу тактасы - Flutter UI",
    description:
        "Flutter V2.* желеде расмий түрдө туруктуу бутакта колдоого алынат. Бүгүн мен Админ панелин бөлүшөм же сиз аны Flutter менен түзүлгөн UI панели деп атасаңыз болот. Эми сиз Flutter аркылуу колдонмонун башкаруу тактасын түзө аласыз. Бул тактайда диаграмма, таблица, маалыматты көрсөтүү үчүн жакшы кичинекей карта сыяктуу керектүү нерселердин бардыгы камтылган.",
  ),
  Project(
    title: "E-Коммерсия колдонмосу - Flutter UI",
    description:
        "Толук электрондук коммерция колдонмобуздун биринчи бөлүгүндө биз сизге электрондук коммерция колдонмоңуз үчүн Android жана iOS түзмөктөрүн тең иштете ала турган жакшынакай таза борттук экранды кантип түзө аларыңызды көрсөтөбүз, анткени ал флуттер менен түзүлөт. Андан кийин экинчи эпизоддо биз ыңгайлаштырылган ката индикатору менен Кирүү, Сырсөздү унуттум экранын курабыз.",
  ),
  Project(
    title:
        "Outlook Email App Flutter -  Толугу менен жооп беруучу дизайн интерфейси",
    description:
        "Биз Outlook колдонмосун кайра иштеп чыгабыз, ошондой эле аны телефонуңузда, өтмөктө же интернетте бардык жерде иштете аласыз. Бул толкунданууга жооп берүүчү видеодо биз сизге флиттердин чыныгы күчүн көрсөтөбүз. Бир код базасынан мобилдик, веб жана рабочий колдонмосун жасаңыз.",
  ),
  Project(
    title: "Чат/Кабарлашуу колдонмосу жарык жана карангы тема - Flutter UI",
    description:
        "Бүгүн биз Android жана iOS түзмөктөрүн иштеткен #flutter аркылуу #ui мессинг/чат колдонмосун курабыз, ал караңгы жана жарык темага ээ. Биз бардыгы болуп 4 экранды түзөбүз, алардын бардыгы кара теманы жана жарык теманы колдойт. Алгач, биз тег сызыгы бар сүрөттү камтыган саламдашуу экранын иштеп чыгабыз, ошондой эле өткөрүп жиберүү баскычы бар.",
  ),
  Project(
    title:
        "Саламдашуу баракчасы, Кируу баракчасы жана Каттоо баракчасы - Flutter UI",
    description:
        "Толук электрондук коммерция колдонмобуздун биринчи бөлүгүндө биз сизге электрондук коммерция колдонмоңуз үчүн Android жана iOS түзмөктөрүн тең иштете ала турган жакшынакай таза борттук экранды кантип түзө аларыңызды көрсөтөбүз, анткени ал флуттер менен түзүлөт. Андан кийин экинчи эпизоддо биз ыңгайлаштырылган ката индикатору менен Кирүү, Сырсөздү унуттум экранын курабыз.",
  ),
  Project(
    title: "Covid-19 колдонмосу - Flutter UI",
    description:
        "Биз Outlook колдонмосун кайра иштеп чыгабыз, ошондой эле аны телефонуңузда, өтмөктө же интернетте бардык жерде иштете аласыз. Бул толкунданууга жооп берүүчү видеодо биз сизге флиттердин чыныгы күчүн көрсөтөбүз. Бир код базасынан мобилдик, веб жана рабочий колдонмосун жасаңыз.",
  ),
];
