class Recommendation {
  final String? name, source, text;

  Recommendation({this.name, this.source, this.text});
}

final List<Recommendation> demo_recommendations = [
  Recommendation(
    name: "Altynbek Chotonov",
    source: "Linkedin",
    text:
        "Flutter – бул бир эле кодду колдоно турган платформалар аралык тиркемелерди түзүүгө мүмкүндүк берген Google компаниясынын программасы.Бул веб-тиркемелер, Android жана iOS үчүн мобилдик тиркемелер, Windows, MacOS, Linux рабочий системалары үчүн графикалык тиркемелер, ошондой эле веб-тиркемелер учун. ",
  ),
  Recommendation(
    name: "Turat Alybaev",
    source: "Linkedin",
    text:
        "Алтынбек  менен жумушта иштөө чыныгы ырахат. Анын иштөө чеберчилиги таң калыштуу, ошондой эле анын кесипкөйлүгү жана мыкты команда ишчиси. Алтынбек проблеманы чече билгени да анын эң чоң өнөрүнүн бири.",
  ),
  Recommendation(
    name: "Perizat",
    source: "YouTube",
    text:
        "Долбооруңузду аткарып жатканыңыз жана бизге үйрөткөнүңүз мага жагат. Мен муну көргөндөн кийин мен жактырам жана жазылуу баскычын басам, анан видео плейлистти бирден көрөм!! Үч сааттын ичинде мен көп нерсени үйрөндүм! Мен сиздин каналыңызды колледжимдеги WhatsApp тобунда бөлүшөм!",
  ),
  Recommendation(
    name: "Bolot Janybekov",
    source: "YouTube",
    text:
        "Абдан жөнөкөй, профессионалдуу жана ошондой эле YouTube'дагы эң мыкты флтер видеолору! Бул кадамды ишке ашыруудан мурун 0,5 секунд тыныгуу менен кадамдарыңызга кандайдыр бир комментарийлерди кошсоңуз жакшы болот. Кадамдардын мааниси менен мен негизги эмес, структуралык кадамдарды айтып жатам, мисалы, видеого 10-20 кадам. Бирок, сизге чоң рахмат!",
  ),
];
